cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'carthage'
brew 'cmake'
brew 'ctags'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'fzf'
brew 'ghq'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'gradle'
brew 'macvim'
brew 'nvm'
brew 'phantomjs'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'wget'
brew 'zsh'

cask '1password'
cask 'android-studio'
cask 'appcode'
cask 'atom'
cask 'cleanapp'
cask 'firefox'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-cloud-sdk'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'kindle'
cask 'mysqlworkbench'
cask 'pixate-studio'
cask 'rightfont'
cask 'sketch'
cask 'slack'
cask 'sublime-text'
cask 'totalfinder'
cask 'todoist'
cask 'virtualbox'
cask 'zeplin'
