cask_args appdir: '/Applications'

tap 'homebrew/science'
tap 'caskroom/cask'
tap 'caskroom/versions'

brew 'asciinema'
brew 'boost'
brew 'carthage'
brew 'cmake'
brew 'cppcheck'
brew 'ctags'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'fabric'
brew 'fzf'
brew 'ghq'
brew 'git'
brew 'git-lfs'
brew 'go'
brew 'gradle'
brew 'htop'
brew 'hugo'
brew 'kotlin'
brew 'llvm'
brew 'macvim'
brew 'nvm'
brew 'opencv3'
brew 'phantomjs'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'r'
brew 'rbenv'
brew 'swiftgen'
brew 'swiftlint'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmux'
brew 'wget'
brew 'zsh'

cask '1password'
cask 'android-studio'
cask 'appcode'
cask 'atom'
cask 'cleanapp'
cask 'dropbox'
cask 'fastlane'
cask 'firefox'
cask 'github-desktop'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'java'
cask 'iterm2'
cask 'kindle'
cask 'mysqlworkbench'
cask 'pixate-studio'
cask 'rightfont'
cask 'rstudio'
cask 'sketch'
cask 'slack'
cask 'sublime-text'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'zeplin'
