cask_args appdir: '/Applications', require_sha: true

brew 'agent-browser'
brew 'docker-compose'
brew 'eza'
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'gh'
brew 'ghq'
brew 'git'
brew 'goenv'
brew 'gpg'
brew 'lazygit'
brew 'lefthook'
brew 'neovim'
brew 'node-build'
brew 'nodenv'
brew 'pinentry-mac'
brew 'pyenv'
brew 'rbenv'
brew 'ripgrep'
brew 'ruby-build'
brew 'starship'
brew 'tfenv'
brew 'tig'
brew 'tmux'
brew 'tree-sitter'
brew 'wget'
brew 'zoxide'

cask '1password'
cask '1password-cli'
cask 'antigravity'
cask 'brave-browser'
cask 'claude-code'
cask 'cursor'
cask 'font-hack-nerd-font'
cask 'ghostty'
cask 'github'
cask 'google-cloud-sdk'
cask 'google-japanese-ime'
cask 'karabiner-elements'
cask 'linear'
cask 'raycast'
cask 'visual-studio-code@insiders'
cask 'zed'
