" ------------------------------------------------------------------------------
" プラグインの設定
" ------------------------------------------------------------------------------

" NERDTree
" ------------------------------------------------------------------------------

autocmd vimenter * NERDTree

let g:NERDTreeDirArrowExpandable = '▸'
let g:NERDTreeDirArrowCollapsible = '▾'

let NERDTreeShowHidden = 1

" CtrlP
" ------------------------------------------------------------------------------

let g:ctrlp_map = '<c-p>'
let g:ctrlp_custom_ignore = '\v[\/]\.(git|hg|svn)$'

" Emmet
" ------------------------------------------------------------------------------

let g:user_emmet_expandabbr_key = '<C-z>'
